---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope.IdentifyExteriorElements
enum: Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope
source: html/38b227f5-0d59-fef1-c617-a9ee57c80ff5.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope.IdentifyExteriorElements

This method uses a combination of ray-casting and flood-fill algorithms in order to identify the building elements that are
 exposed to the outside of the building, the building envelope. Analytical surface originated from the building elements in the envelope
 will be classified as exterior or shading surfaces.